pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr5964.h
sfr_w(DMACTL0);                               /* DMA Control 0 */
sfr_b(DMACTL0_L);
sfr_b(DMACTL0_H);
sfr_w(DMACTL1);                               /* DMA Control 1 */
sfr_b(DMACTL1_L);
sfr_b(DMACTL1_H);
sfr_w(DMACTL2);                               /* DMA Control 2 */
sfr_b(DMACTL2_L);
sfr_b(DMACTL2_H);
sfr_w(DMACTL4);                               /* DMA Control 4 */
sfr_b(DMACTL4_L);
sfr_b(DMACTL4_H);
sfr_w(DMAIV);                                 /* DMA Interrupt Vector */
sfr_b(DMAIV_L);
sfr_b(DMAIV_H);
sfr_w(DMA0CTL);                               /* DMA Channel 0 Control */
sfr_b(DMA0CTL_L);
sfr_b(DMA0CTL_H);
sfr_a(DMA0SA);                                /* DMA Channel 0 Source Address */

sfr_a(DMA0DA);                                /* DMA Channel 0 Destination Address */

sfr_w(DMA0SZ);                                /* DMA Channel 0 Transfer Size */
sfr_b(DMA0SZ_L);
sfr_b(DMA0SZ_H);
sfr_w(DMA1CTL);                               /* DMA Channel 1 Control */
sfr_b(DMA1CTL_L);
sfr_b(DMA1CTL_H);
sfr_a(DMA1SA);                                /* DMA Channel 1 Source Address */

sfr_a(DMA1DA);                                /* DMA Channel 1 Destination Address */

sfr_w(DMA1SZ);                                /* DMA Channel 1 Transfer Size */
sfr_b(DMA1SZ_L);
sfr_b(DMA1SZ_H);
sfr_w(DMA2CTL);                               /* DMA Channel 2 Control */
sfr_b(DMA2CTL_L);
sfr_b(DMA2CTL_H);
sfr_a(DMA2SA);                                /* DMA Channel 2 Source Address */

sfr_a(DMA2DA);                                /* DMA Channel 2 Destination Address */

sfr_w(DMA2SZ);                                /* DMA Channel 2 Transfer Size */
sfr_b(DMA2SZ_L);
sfr_b(DMA2SZ_H);
sfr_w(DMA3CTL);                               /* DMA Channel 3 Control */
sfr_b(DMA3CTL_L);
sfr_b(DMA3CTL_H);
sfr_a(DMA3SA);                                /* DMA Channel 3 Source Address */

sfr_a(DMA3DA);                                /* DMA Channel 3 Destination Address */

sfr_w(DMA3SZ);                                /* DMA Channel 3 Transfer Size */
sfr_b(DMA3SZ_L);
sfr_b(DMA3SZ_H);
sfr_w(DMA4CTL);                               /* DMA Channel 4 Control */
sfr_b(DMA4CTL_L);
sfr_b(DMA4CTL_H);
sfr_a(DMA4SA);                                /* DMA Channel 4 Source Address */

sfr_a(DMA4DA);                                /* DMA Channel 4 Destination Address */

sfr_w(DMA4SZ);                                /* DMA Channel 4 Transfer Size */
sfr_b(DMA4SZ_L);
sfr_b(DMA4SZ_H);
sfr_w(DMA5CTL);                               /* DMA Channel 5 Control */
sfr_b(DMA5CTL_L);
sfr_b(DMA5CTL_H);
sfr_a(DMA5SA);                                /* DMA Channel 5 Source Address */

sfr_a(DMA5DA);                                /* DMA Channel 5 Destination Address */

sfr_w(DMA5SZ);                                /* DMA Channel 5 Transfer Size */
sfr_b(DMA5SZ_L);
sfr_b(DMA5SZ_H);

/* DMA Register Offsets */
#define OFS_DMACTL0                      (0x0000)
#define OFS_DMACTL0_L                    OFS_DMACTL0
#define OFS_DMACTL0_H                    OFS_DMACTL0+1
#define OFS_DMACTL1                      (0x0002)
#define OFS_DMACTL1_L                    OFS_DMACTL1
#define OFS_DMACTL1_H                    OFS_DMACTL1+1
#define OFS_DMACTL2                      (0x0004)
#define OFS_DMACTL2_L                    OFS_DMACTL2
#define OFS_DMACTL2_H                    OFS_DMACTL2+1
#define OFS_DMACTL4                      (0x0008)
#define OFS_DMACTL4_L                    OFS_DMACTL4
#define OFS_DMACTL4_H                    OFS_DMACTL4+1
#define OFS_DMAIV                        (0x000E)
#define OFS_DMAIV_L                      OFS_DMAIV
#define OFS_DMAIV_H                      OFS_DMAIV+1
#define OFS_DMA0CTL                      (0x0010)
#define OFS_DMA0CTL_L                    OFS_DMA0CTL
#define OFS_DMA0CTL_H                    OFS_DMA0CTL+1
#define OFS_DMA0SA                       (0x0012)
#define OFS_DMA0SA_L                     OFS_DMA0SA
#define OFS_DMA0SA_H                     OFS_DMA0SA+2
#define OFS_DMA0DA                       (0x0016)
#define OFS_DMA0DA_L                     OFS_DMA0DA
#define OFS_DMA0DA_H                     OFS_DMA0DA+2
#define OFS_DMA0SZ                       (0x001A)
#define OFS_DMA0SZ_L                     OFS_DMA0SZ
#define OFS_DMA0SZ_H                     OFS_DMA0SZ+1
#define OFS_DMA1CTL                      (0x0020)
#define OFS_DMA1CTL_L                    OFS_DMA1CTL
#define OFS_DMA1CTL_H                    OFS_DMA1CTL+1
#define OFS_DMA1SA                       (0x0022)
#define OFS_DMA1SA_L                     OFS_DMA1SA
#define OFS_DMA1SA_H                     OFS_DMA1SA+2
#define OFS_DMA1DA                       (0x0026)
#define OFS_DMA1DA_L                     OFS_DMA1DA
#define OFS_DMA1DA_H                     OFS_DMA1DA+2
#define OFS_DMA1SZ                       (0x002A)
#define OFS_DMA1SZ_L                     OFS_DMA1SZ
#define OFS_DMA1SZ_H                     OFS_DMA1SZ+1
#define OFS_DMA2CTL                      (0x0030)
#define OFS_DMA2CTL_L                    OFS_DMA2CTL
#define OFS_DMA2CTL_H                    OFS_DMA2CTL+1
#define OFS_DMA2SA                       (0x0032)
#define OFS_DMA2SA_L                     OFS_DMA2SA
#define OFS_DMA2SA_H                     OFS_DMA2SA+2
#define OFS_DMA2DA                       (0x0036)
#define OFS_DMA2DA_L                     OFS_DMA2DA
#define OFS_DMA2DA_H                     OFS_DMA2DA+2
#define OFS_DMA2SZ                       (0x003A)
#define OFS_DMA2SZ_L                     OFS_DMA2SZ
#define OFS_DMA2SZ_H                     OFS_DMA2SZ+1
#define OFS_DMA3CTL                      (0x0040)
#define OFS_DMA3CTL_L                    OFS_DMA3CTL
#define OFS_DMA3CTL_H                    OFS_DMA3CTL+1
#define OFS_DMA3SA                       (0x0042)
#define OFS_DMA3SA_L                     OFS_DMA3SA
#define OFS_DMA3SA_H                     OFS_DMA3SA+2
#define OFS_DMA3DA                       (0x0046)
#define OFS_DMA3DA_L                     OFS_DMA3DA
#define OFS_DMA3DA_H                     OFS_DMA3DA+2
#define OFS_DMA3SZ                       (0x004A)
#define OFS_DMA3SZ_L                     OFS_DMA3SZ
#define OFS_DMA3SZ_H                     OFS_DMA3SZ+1
#define OFS_DMA4CTL                      (0x0050)
#define OFS_DMA4CTL_L                    OFS_DMA4CTL
#define OFS_DMA4CTL_H                    OFS_DMA4CTL+1
#define OFS_DMA4SA                       (0x0052)
#define OFS_DMA4SA_L                     OFS_DMA4SA
#define OFS_DMA4SA_H                     OFS_DMA4SA+2
#define OFS_DMA4DA                       (0x0056)
#define OFS_DMA4DA_L                     OFS_DMA4DA
#define OFS_DMA4DA_H                     OFS_DMA4DA+2
#define OFS_DMA4SZ                       (0x005A)
#define OFS_DMA4SZ_L                     OFS_DMA4SZ
#define OFS_DMA4SZ_H                     OFS_DMA4SZ+1
#define OFS_DMA5CTL                      (0x0060)
#define OFS_DMA5CTL_L                    OFS_DMA5CTL
#define OFS_DMA5CTL_H                    OFS_DMA5CTL+1
#define OFS_DMA5SA                       (0x0062)
#define OFS_DMA5SA_L                     OFS_DMA5SA
#define OFS_DMA5SA_H                     OFS_DMA5SA+2
#define OFS_DMA5DA                       (0x0066)
#define OFS_DMA5DA_L                     OFS_DMA5DA
#define OFS_DMA5DA_H                     OFS_DMA5DA+2
#define OFS_DMA5SZ                       (0x006A)
#define OFS_DMA5SZ_L                     OFS_DMA5SZ
#define OFS_DMA5SZ_H                     OFS_DMA5SZ+1

/* DMA Control Bits */

